{
  "users": [
    {
      "id": "enid",
      "passwordHash": "4813494d137e1631bba301d5acab6e7bb7aa74ce1185d456565ef51d737677b2",
      "name": "Enid Blyton"
    },
    {
      "id": "william",
      "passwordHash": "a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3",
      "name": "William Shakespeare"
    },
    {
      "id": "salman",
      "passwordHash": "688787d8ff144c502c7f5cffaafe2cc588d86079f9de88304c26b0cb99ce91c6",
      "name": "Salman A"
    }
  ],
  "articles": [
    {
      "title": "A Square Peg in a Round Hole",
      "image": "https://miro.medium.com/max/1224/1*rl1R6C0Hq4e50oUKTdx5lw.jpeg",
      "id": 9,
      "name": "a-square-peg-in-a-round-hole",
      "author": "Enid Blyton",
      "content": [
        "Those days, I looked forward to the warm comfort of sleep rather than the cold splashes of reality. The closest I came to feeling awake was when I fell asleep. It made me forget about everything else that was going on in my life. It made me forget about how tired I was.",
        "I was tired of living. I was tired of pretending. I was tired of struggling.",
        "All I wanted was an escape.",
        "The struggles just kept growing as the days passed by. It kept piling up. And it kept piling up. The days became indistinguishable.",
        "And I wept. I wept every day while trying to sleep.",
        "And then, I added a new line!"
      ]
    },
    {
      "title": "What Is Blogging?",
      "image": "https://www.thebalancesmb.com/thmb/RnTGoWY-dheBMpNRfOpn7eRvb78=/1650x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/blogging-what-is-it-1794405-v2-5b60d316c9e77c0050f7eb9e.png",
      "name": "what-is-blogging",
      "author": "Salman A",
      "content": [
        "Blogging refers to writing, photography, and other media that's self-published online. Blogging started as an opportunity for individuals to write diary-style entries, but it has since been incorporated into websites for many businesses. The hallmarks of blogging include frequent updates, informal language, and opportunities for readers to engage and start a conversation.",
        "Here's an overview of what a blog is, why it's popular, and tips for starting your own blog.",
        "",
        "What Is Blogging?",
        "The word blog is actually a shortened form of its original name, \"weblog.\" These weblogs allowed early internet users to \"log\" the details of their day in diary-style entries. Blogs often allow readers to comment, so as they became more common, communities sprung up around popular blogs.",
        "",
        "How Blogging Works",
        "Blogging is as simple as obtaining a website and publishing original content on it. Tech-savvy bloggers can buy a domain name and build the website themselves. Those with less HTML knowledge can create an account with sites like WordPress that simplify the web design and publishing process.",
        "Another unique feature of blogging is interlinking. This occurs when a blogger links to another person's blog within their own blog post. For example, if a music teacher maintains a blog, and they write a blog post about how to form a chord, they might link to a musician's blog to show an example of the chords in action. A political blogger may link to another politics blog and then discuss how they agree or disagree with a post on that blog. Interlinking, along with the comment section, fosters the sense of community that makes blogs unique."
      ],
      "id": 11
    },
    {
      "title": "Living the New Normal",
      "image": "https://miro.medium.com/max/875/0*npHiKh00E_4R-RY9",
      "id": 10,
      "name": "living-the-new-normal",
      "author": "Enid Blyton",
      "content": [
        "Ever since lockdown started, this has been my brother’s constant refrain. He really misses school and friends. The last time he cried was because he didn’t want to go to school. Every day he would fall onto my grandmother’s lap, crying hysterically, begging to let him take the day off. He has lots of friends next to our house and he is the youngest in our family. However hard we try, no one was able to match his energy or entertain him for long. Everyone in the family took turns playing with him.",
        "My little brother has become a very understanding and responsible child in this short time. He channels all his energy to help us out when we need something. My grandma runs a stationery store in front of our house. My brother has begun to identify every wholesaler’s arrival by the sound of their vehicle’s horn or the screech of the tires. It’s actually fascinating to see him pick up these voices and alert my grandma.",
        "Parenting is hard. Parenting during a pandemic is even harder. Teaching my brother was the biggest of all our responsibilities. As the eldest sister, I was given the responsibility of teaching him. I knew I would be the worst primary school teacher even before I agreed to help him with his studies. Every day turned out to be another disastrous experiment.",
        "I used to brag about my minimal social media presence. But, oh boy, was I wrong! I don’t use many apps, but the very few that I do use, I'm addicted to completely. I found out that every week I actually dedicated a whole day to YouTube. That was really scary. Realising this, I tweaked my settings to warn me of overuse and finally began walking without my phones whenever possible. It wasn't easy but I became aware of how much technology was influencing me.",
        "To begin with, I checked the time I spent on my phone. These little handheld accessories actually know too much about us. We can scroll down these digital pages and observe a lot about human society. The most obvious one is the mob mentality of people on the internet. Every word etched in ones and zeros are mines of information about us."
      ]
    },
    {
      "title": "Why is it so hard to get a SWE job?",
      "image": "https://miro.medium.com/max/1400/1*mYTQe3aP6IxOVqFiy2C6qw.jpeg",
      "name": "why-is-it-so-hard-to-get-a-swe-job",
      "author": "Salman A",
      "content": [
        "The title of this post was a trending Quora question, with popular responses boiling down to “it’s not, the unemployment rate is 3.6%,” “there are too many developers and not enough engineers,” and “it’s a natural consequence of microeconomic theory.” It might be useful to elaborate on the last one, but I thought it would be a lot more fun to take a look at the absolute most popular answer:",
        "“I was unemployed for many months. Waited hoping one day someone will hire me without requiring me to white-boarding. Yep it is worse than water-boarding. After 7 months I realized — no other choice. Now I can white board in my sleep. Companies are in line to talk to me. They are ready to send flowers and even ready to send drivers to pick me up.",
        "Nothing changed”",
        "— Aravind Akshan, Engineer Manager at [UNDISCLOSED]",
        "Technical coding interviews are, for lack of a better description, “their own game.” You typically get between 30 minutes to an hour to solve a coding question that assesses your understanding of data structures and algorithms. Regardless of whether you think this is a good test, supporters and critics alike would agree that this is not what you actually do in the field — it’s just a test",
        "Software is BROAD. You can be a frontend developer turning wireframes into a web application. You can be a backend engineer who works very closely with hardware. You can work at a company that cures cancer. You can work at a company that causes cancer. There is an incredible number of fields and roles you may have, and so we face the same scenario we face when dating: Companies will look for a very, very specific candidate with an exact set of skills, and sometimes things just don’t work out",
        "I may be the first person in history with the gall to complain about this, but in coding interviews you usually get a choice of language. One drawback to this is that the engineer interviewing you, if he/she is human, will not be familiar with all of them. If you interview in a language they are unfamiliar with and have any issues, they may not be able to help you."
      ],
      "id": 12
    },
    {
      "title": "Afghanistan Meant Nothing",
      "image": "https://miro.medium.com/max/640/1*S0cd4hoS7JoGjehfr_HKUg.png",
      "id": 2,
      "name": "afghanistan-meant-nothing",
      "author": "Enid Blyton",
      "content": [
        "By the time you read this, the Taliban may already be in Kabul. If not now, then soon.",
        "Nixon wanted — and got — his decent interval between the United States pullout of Vietnam and the inevitable North Vietnamese takeover. Afghanistan’s interval was never going to be decent, but I confess I expected an interval. We’re scrambling to leave in time, we’re racing for the helicopters as the Taliban burns through Afghanistan like a forest fire.",
        "This is what I remember:",
        "There is no third team.",
        "No more pretending it meant anything. It didn’t.",
        "It didn’t mean a goddamn thing.",
        "Source: https://laurajedeed.medium.com/afghanistan-meant-nothing-9e3f099b00e5",
        "Author: Laura Jedeed"
      ]
    }
  ]
}